feat: implement Notification CRD feature
Signed-off-by: Ardika Bagus <me@ardikabs.com>
